//------------------------------------------------------------------------
// NAME: Georgi Lyubenov
// CLASS: XIb
// NUMBER: 10
// PROBLEM: #1
// FILE NAME: strlen.c
// FILE PURPOSE:
// имплементация на функцията strlen от библиотеката <string.h>
// ...
//------------------------------------------------------------------------


#include <stdio.h>

size_t strlen( const char *s){

    //------------------------------------------------------------------------
    // FUNCTION: strclen
    // предназначение на функцията -> върща броя на символите в даден стринг
    // PARAMETERS: един стринг s
    //
    // тяхното значение -> трябва да намерим дължината на s
    //------------------------------------------------------------------------

    int len = 0;
    for(len=0; s[len] != '\0'; len++); //инкрементираме len доакто не стгнем до терминиращата 0
    return len; //връщаме получения брой
}
