//------------------------------------------------------------------------
// NAME: Georgi Lyubenov
// CLASS: XIb
// NUMBER: 10
// PROBLEM: #3
// FILE NAME: swap.c
// FILE PURPOSE:
// размяна на стойностите на две числва от тип int *
// ...
//------------------------------------------------------------------------

#include <stdio.h>

void swap(int *a, int *b){
    //------------------------------------------------------------------------
    // FUNCTION: swap
    // предназначение на функцията -> размяна на стойностите на две числва от тип int *
    // PARAMETERS: две числа от тип int *
    //
    // тяхното значение -> да си разменят стойностите
    //------------------------------------------------------------------------

    int c = *a; // променливата c е помощна променлива в която да запишем стойноста на единия int преди да го променим
    *a = *b;
    *b = c;
}