//------------------------------------------------------------------------
// NAME: Georgi Lyubenov
// CLASS: XIb
// NUMBER: 10
// PROBLEM: #5
// FILE NAME: strdup.c
// FILE PURPOSE:
// динамично заделена памет със същия стринг като подадения 
// ...
//------------------------------------------------------------------------


#include <stdio.h>
#include <stdlib.h>

char *strdup( const char *s ){

    //------------------------------------------------------------------------
    // FUNCTION: strdup
    // предназначение на функцията -> връща пойнтер към динамично заделена памет със същия стринг
    // PARAMETERS: един стринг s
    //
    // тяхното значение -> трябва да намерим дължината на s
    //------------------------------------------------------------------------


    int len = 0;
    for(len=0;s[len] != '\0';len++); // намираме дължината на s
    char *new = malloc(len*sizeof(char));
    for(int i=0;i<len;i++){
        new[i] = s[i]; // копиране на елементие на подадения s със елементите във дианмично заделената памет
    }

    return new;
    
}
