//------------------------------------------------------------------------
// NAME: Georgi Lyubenov
// CLASS: XIb
// NUMBER: 10
// PROBLEM: #4
// FILE NAME: swap2.c
// FILE PURPOSE:
// размяна на стойностите на двa елемента от тип void *
// ...
//------------------------------------------------------------------------

#include<stdio.h>

void swap(void *a, void *b, size_t size){

    //------------------------------------------------------------------------
    // FUNCTION: swap
    // предназначение на функцията -> размяна на стойностите на два елемента от тип int *
    // PARAMETERS: два елемента  от тип void * и size  на типа на преднте две променливи
    //
    // тяхното значение -> да си разменят стойностите а и b, а size за да можем по битово да определим вида на тези променливи и да сменим бит по бит
    // на въпроса може ли без параметъра size -> няма да може тъй като няма да можем да следим колко биа има в памета за тези променливи
    // и няма да можем да разменим техните стойности :) 
    //------------------------------------------------------------------------

    char c; // променливата c е помощна променлива в която да запишем стойноста на единия бит преди да го променим
    char *ap = a;
    char *bp = b;
    while (size--) {
        c = *ap;
        *ap++ = *bp;
        *bp++ = c;
    }
}